<template>
    <section class="articles">
        <item-article v-for="(item,index) in data" :key="index" :data="item"></item-article>
    </section>
</template>

<script>
import ItemArticle from '@/components/articleList/ItemArticle.vue'

export default {
    components: {
        ItemArticle
    },
    data() {
        return {
            data: [
                {
                    imgUrl: '/img/photo-eye.jpeg',
                    link: '#',
                    title: 'История об одном глазе и 20 операциях (не читать впечатлительным) или он хотел быть летчиком, а его не пускали в небо',
                    description: 'Как вы думаете, сколько операций можно сделать на одном глазу? Клинический случай одного из моих пациентов подтверждает, что более 20 операций разного рода – не предел. Хотя, вне сомнения, этот случай – рекорд для России и мировой офтальмологии.'
                },
                {
                    imgUrl: '/img/photo-eye.jpeg',
                    link: '#',
                    title: 'История об одном глазе и 20 операциях (не читать впечатлительным) или он хотел быть летчиком, а его не пускали в небо',
                    description: 'Как вы думаете, сколько операций можно сделать на одном глазу? Клинический случай одного из моих пациентов подтверждает, что более 20 операций разного рода – не предел. Хотя, вне сомнения, этот случай – рекорд для России и мировой офтальмологии.'
                }
            ]
        }
    }
}
</script>